package cn.sunline.pcm.definition.enums;
import cn.sunline.common.annotation.enums.EnumInfo;

/**
 * 行业范围
 * @author fgy
 * 2019年7月28日
 */
@EnumInfo({
        "A|农、林、牧、渔业",
        "B|采矿业",
        "C|制造业",
        "D|电力、燃气及水的生产和供应业",
        "E|建筑业",
        "F|采矿业",
        "G|交通运输、仓储和邮政业",
        "H|批发和零售业",
        "I|住宿和餐饮业",
        "J|金融业",
        "K|房地产业",
        "L|租赁和商务服务业",
        "M|科学研究、技术服务和地质勘查业",
        "N|水利、环境和公共设施管理业",
        "O|居民服务和其他服务业"
})
public enum FundSideBusinessScope {
    //A("农、林、牧、渔业"),
    //B("采矿业"),
    //C("制造业"),
    //D("电力、燃气及水的生产和供应业"),
    //E("建筑业"),
    //F("采矿业"),
    //G("交通运输、仓储和邮政业"),
    //H("批发和零售业"),
    //I("住宿和餐饮业"),
    //J("金融业"),
    //K("房地产业"),
    //L("租赁和商务服务业"),
    //M("科学研究、技术服务和地质勘查业"),
    //N("水利、环境和公共设施管理业"),
    //O("居民服务和其他服务业");
    A,B,C,D,E,F,G,H,I,J,K,L,M,N,O;
}
